In [3]:
import pandas as pd

In [5]:
import numpy as np

In [13]:
co=pd.read_csv("course.csv")

In [15]:
print(co)

     1     Mumbai        PQR institute .Pvt            BI  MH   9 Months
0    2      Delhi    ABC institute .Pvt.LTD            AI  UP  18 Months
1    3  Bengaluru       MNO  institute .Ltd  Data Science  TN  11 Months
2    4     Bhopal   RST  institute .Pvt.LTD            ML  MP   3 Months
3    5     Mumbai   EFG  institute .Pvt.LTD            DL  MH   3 Months
4    6  Hyderabad           LMN  institute          Could  AP   4 Months
5    7      Patna      DEF   institute .Ltd      Web Serv  BH   4 Months
6    8    Channai   PQR  institute .Pvt.LTD           AWS  KT   3 Months
7    9    Kolkata       UVW  institute .Ltd    Networking  WB   3 Months
8   10  Hyderabad      GHI   institute .Ltd            AI  AP  18 Months
9   11     Bhopal          IJK   institute             DL  MP   3 Months
10  12       Pune      KLM   institute .Ltd  Data Science  MH  11 Months
11  13      Delhi       STU  institute .Ltd            BI  UP   6 Months
12  14     Mumbai   XYZ  institute .Pvt.LTD         Could  MH   3 Months
13  15      Patna       NOP  institute .Ltd           AWS  BH   3 Months
14  16      Surat       QRS  institute .Ltd            ML  GJ   3 Months
15  17      Delhi           WXY  institute            AWS  UP   3 Months
16  18     Mumbai          ZAB   institute       Web Serv  MH   4 Months
17  19       Pune       CDE  institute .Ltd  Data Science  MH  11 Months
18  20  Bengaluru   JKL  institute .Pvt.LTD            AI  TN  18 Months
19  21      Surat           INS   institute  Data Science  Gj  11 Months
20  22  Hyderabad       ZAP  institute .Ltd            ML  AP   3 Months
21  23     Mumbai  XCAD  institute .Pvt.LTD            DL  MH   3 Months
22  24    Channai          MTK   institute          Could  KT   4 Months
23  25      Patna       BST  institute .Ltd      Web Serv  BH   4 Months

In [17]:
co.head

<bound method NDFrame.head of      1     Mumbai        PQR institute .Pvt            BI  MH   9 Months
0    2      Delhi    ABC institute .Pvt.LTD            AI  UP  18 Months
1    3  Bengaluru       MNO  institute .Ltd  Data Science  TN  11 Months
2    4     Bhopal   RST  institute .Pvt.LTD            ML  MP   3 Months
3    5     Mumbai   EFG  institute .Pvt.LTD            DL  MH   3 Months
4    6  Hyderabad           LMN  institute          Could  AP   4 Months
5    7      Patna      DEF   institute .Ltd      Web Serv  BH   4 Months
6    8    Channai   PQR  institute .Pvt.LTD           AWS  KT   3 Months
7    9    Kolkata       UVW  institute .Ltd    Networking  WB   3 Months
8   10  Hyderabad      GHI   institute .Ltd            AI  AP  18 Months
9   11     Bhopal          IJK   institute             DL  MP   3 Months
10  12       Pune      KLM   institute .Ltd  Data Science  MH  11 Months
11  13      Delhi       STU  institute .Ltd            BI  UP   6 Months
12  14     Mumbai   XYZ  institute .Pvt.LTD         Could  MH   3 Months
13  15      Patna       NOP  institute .Ltd           AWS  BH   3 Months
14  16      Surat       QRS  institute .Ltd            ML  GJ   3 Months
15  17      Delhi           WXY  institute            AWS  UP   3 Months
16  18     Mumbai          ZAB   institute       Web Serv  MH   4 Months
17  19       Pune       CDE  institute .Ltd  Data Science  MH  11 Months
18  20  Bengaluru   JKL  institute .Pvt.LTD            AI  TN  18 Months
19  21      Surat           INS   institute  Data Science  Gj  11 Months
20  22  Hyderabad       ZAP  institute .Ltd            ML  AP   3 Months
21  23     Mumbai  XCAD  institute .Pvt.LTD            DL  MH   3 Months
22  24    Channai          MTK   institute          Could  KT   4 Months
23  25      Patna       BST  institute .Ltd      Web Serv  BH   4 Months>

In [19]:
co.head(10)

    1     Mumbai       PQR institute .Pvt            BI  MH   9 Months
0   2      Delhi   ABC institute .Pvt.LTD            AI  UP  18 Months
1   3  Bengaluru      MNO  institute .Ltd  Data Science  TN  11 Months
2   4     Bhopal  RST  institute .Pvt.LTD            ML  MP   3 Months
3   5     Mumbai  EFG  institute .Pvt.LTD            DL  MH   3 Months
4   6  Hyderabad          LMN  institute          Could  AP   4 Months
5   7      Patna     DEF   institute .Ltd      Web Serv  BH   4 Months
6   8    Channai  PQR  institute .Pvt.LTD           AWS  KT   3 Months
7   9    Kolkata      UVW  institute .Ltd    Networking  WB   3 Months
8  10  Hyderabad     GHI   institute .Ltd            AI  AP  18 Months
9  11     Bhopal         IJK   institute             DL  MP   3 Months

In [23]:
co.tail

<bound method NDFrame.tail of      1     Mumbai        PQR institute .Pvt            BI  MH   9 Months
0    2      Delhi    ABC institute .Pvt.LTD            AI  UP  18 Months
1    3  Bengaluru       MNO  institute .Ltd  Data Science  TN  11 Months
2    4     Bhopal   RST  institute .Pvt.LTD            ML  MP   3 Months
3    5     Mumbai   EFG  institute .Pvt.LTD            DL  MH   3 Months
4    6  Hyderabad           LMN  institute          Could  AP   4 Months
5    7      Patna      DEF   institute .Ltd      Web Serv  BH   4 Months
6    8    Channai   PQR  institute .Pvt.LTD           AWS  KT   3 Months
7    9    Kolkata       UVW  institute .Ltd    Networking  WB   3 Months
8   10  Hyderabad      GHI   institute .Ltd            AI  AP  18 Months
9   11     Bhopal          IJK   institute             DL  MP   3 Months
10  12       Pune      KLM   institute .Ltd  Data Science  MH  11 Months
11  13      Delhi       STU  institute .Ltd            BI  UP   6 Months
12  14     Mumbai   XYZ  institute .Pvt.LTD         Could  MH   3 Months
13  15      Patna       NOP  institute .Ltd           AWS  BH   3 Months
14  16      Surat       QRS  institute .Ltd            ML  GJ   3 Months
15  17      Delhi           WXY  institute            AWS  UP   3 Months
16  18     Mumbai          ZAB   institute       Web Serv  MH   4 Months
17  19       Pune       CDE  institute .Ltd  Data Science  MH  11 Months
18  20  Bengaluru   JKL  institute .Pvt.LTD            AI  TN  18 Months
19  21      Surat           INS   institute  Data Science  Gj  11 Months
20  22  Hyderabad       ZAP  institute .Ltd            ML  AP   3 Months
21  23     Mumbai  XCAD  institute .Pvt.LTD            DL  MH   3 Months
22  24    Channai          MTK   institute          Could  KT   4 Months
23  25      Patna       BST  institute .Ltd      Web Serv  BH   4 Months>

In [29]:
co.tail(12)

     1     Mumbai        PQR institute .Pvt            BI  MH   9 Months
12  14     Mumbai   XYZ  institute .Pvt.LTD         Could  MH   3 Months
13  15      Patna       NOP  institute .Ltd           AWS  BH   3 Months
14  16      Surat       QRS  institute .Ltd            ML  GJ   3 Months
15  17      Delhi           WXY  institute            AWS  UP   3 Months
16  18     Mumbai          ZAB   institute       Web Serv  MH   4 Months
17  19       Pune       CDE  institute .Ltd  Data Science  MH  11 Months
18  20  Bengaluru   JKL  institute .Pvt.LTD            AI  TN  18 Months
19  21      Surat           INS   institute  Data Science  Gj  11 Months
20  22  Hyderabad       ZAP  institute .Ltd            ML  AP   3 Months
21  23     Mumbai  XCAD  institute .Pvt.LTD            DL  MH   3 Months
22  24    Channai          MTK   institute          Could  KT   4 Months
23  25      Patna       BST  institute .Ltd      Web Serv  BH   4 Months

In [31]:
co.shape

(24, 6)

In [33]:
co.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   1                   24 non-null     int64
 1   Mumbai              24 non-null     object
 2   PQR institute .Pvt  24 non-null     object
 3   BI                  24 non-null     object
 4   MH                  24 non-null     object
 5   9 Months            24 non-null     object
dtypes: int64(1), object(5)
memory usage: 1.3+ KB

In [41]:
co.dtypes

1                      int64
Mumbai                object
PQR institute .Pvt    object
BI                    object
MH                    object
9 Months              object
dtype: object

In [47]:
co.describe()

               1
count  24.000000
mean   13.500000
std     7.071068
min     2.000000
25%     7.750000
50%    13.500000
75%    19.250000
max    25.000000

In [53]:
co.loc[7,["Mumbai"]]

Mumbai    Kolkata
Name: 7, dtype: object

In [55]:
co.iloc[5:12,[1,2,4]]

       Mumbai       PQR institute .Pvt  MH
5       Patna     DEF   institute .Ltd  BH
6     Channai  PQR  institute .Pvt.LTD  KT
7     Kolkata      UVW  institute .Ltd  WB
8   Hyderabad     GHI   institute .Ltd  AP
9      Bhopal         IJK   institute   MP
10       Pune     KLM   institute .Ltd  MH
11      Delhi      STU  institute .Ltd  UP

In [69]:
co["Mumbai"].value_counts()

Mumbai
Mumbai       4
Delhi        3
Hyderabad    3
Patna        3
Bengaluru    2
Bhopal       2
Channai      2
Pune         2
Surat        2
Kolkata      1
Name: count, dtype: int64

In [77]:
co["Mumbai"].unique()

array(['Delhi', 'Bengaluru', 'Bhopal', 'Mumbai', 'Hyderabad', 'Patna',
       'Channai', 'Kolkata', 'Pune', 'Surat'], dtype=object)